-- sqlで全角空白で分割する

-- 分割する対象に含まれている全角空白の数を確認
SELECT texts,
       (LENGTH(texts) - LENGTH(REPLACE(texts, '　', ''))) / LENGTH('　') AS CNT
  FROM (SELECT DISTINCT texts AS texts
          FROM sample_data) AS tbl
 ORDER BY CNT DESC;

-- +-----------------------------------------------------+--------+
-- | texts                                               | CNT    |
-- +-----------------------------------------------------+--------+
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | 4.0000 |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | 4.0000 |
-- | ほげ　ふが　ほげら太郎　42                          | 3.0000 |
-- +-----------------------------------------------------+--------+
-- 3 rows in set (0.000 sec)



-- 一番左端のテキストを取り出す
SELECT texts AS name,
       SUBSTRING_INDEX(texts, '　', 1) AS name1
    FROM sample_data;

-- +-----------------------------------------------------+--------+
-- | name                                                | name1  |
-- +-----------------------------------------------------+--------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげ   |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ほげ   |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ほげ   |
-- +-----------------------------------------------------+--------+
-- 3 rows in set (0.000 sec)


-- テスト
SELECT texts AS name,
       SUBSTRING_INDEX(texts, '　', -2) AS name1,
       SUBSTRING_INDEX(texts, '　', -1) AS name2
    --    SUBSTRING_INDEX(texts, '　', 2) AS name1,
    --    SUBSTRING_INDEX(texts, '　', 1) AS name2
    --    SUBSTRING_INDEX(name1, '　', 1) AS name2
    FROM sample_data;

-- +-----------------------------------------------------+------------------------+-------+
-- | name                                                | name1                  | name2 |
-- +-----------------------------------------------------+------------------------+-------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげら太郎　42         | 42    |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ほげら花子　1729       | 1729  |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ほげら花子　1984       | 1984  |
-- +-----------------------------------------------------+------------------------+-------+
-- 3 rows in set (0.000 sec)


-- 右から2つののテキストを取り出す
SELECT texts AS name,
       SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', -2), '　', 1) AS name1,
       SUBSTRING_INDEX(texts, '　', -1) AS name2
    FROM sample_data;

-- +-----------------------------------------------------+-----------------+-------+
-- | name                                                | name1           | name2 |
-- +-----------------------------------------------------+-----------------+-------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげら太郎      | 42    |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ほげら花子      | 1729  |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ほげら花子      | 1984  |
-- +-----------------------------------------------------+-----------------+-------+
-- 3 rows in set (0.000 sec)


-- 左から2つのテキストを取り出す
SELECT texts AS name,
       SUBSTRING_INDEX(texts, '　', 1) AS name1,
       SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 2), '　', -1) AS name2
    FROM sample_data;

-- +-----------------------------------------------------+--------+----------+
-- | name                                                | name1  | name2    |
-- +-----------------------------------------------------+--------+----------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげ   | ふが     |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ほげ   | ふが23   |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ほげ   | ふが23   |
-- +-----------------------------------------------------+--------+----------+
-- 3 rows in set (0.000 sec)


-- 左から2つのテキストを取り出す
SELECT texts AS name,
       SUBSTRING_INDEX(texts, '　', 1) AS name1,
       SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 2), '　', -1) AS name2
    FROM sample_data2;

-- +-------------------------------------------------------+--------+----------+
-- | name                                                  | name1  | name2    |
-- +-------------------------------------------------------+--------+----------+
-- | ほげ　ふが　ぴよぴよ　ほげら太郎　42                  | ほげ   | ふが     |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                  | ほげ   | ふが23   |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                  | ほげ   | ふが23   |
-- +-------------------------------------------------------+--------+----------+
-- 3 rows in set (0.000 sec)



-- 左から3つ目のテキストを取り出す
SELECT texts AS name,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 3), '　', -1) AS name2
        FROM sample_data;

-- +-----------------------------------------------------+-----------------+
-- | name                                                | name2           |
-- +-----------------------------------------------------+-----------------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげら太郎      |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ぴよ            |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ぴよ            |
-- +-----------------------------------------------------+-----------------+
-- 3 rows in set (0.000 sec)


-- 左から3つ目のテキストを取り出す
SELECT texts AS name,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 3), '　', -1) AS name2
        FROM sample_data2;

-- +-------------------------------------------------------+--------------+
-- | name                                                  | name2        |
-- +-------------------------------------------------------+--------------+
-- | ほげ　ふが　ぴよぴよ　ほげら太郎　42                  | ぴよぴよ     |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                  | ぴよ         |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                  | ぴよ         |
-- +-------------------------------------------------------+--------------+
-- 3 rows in set (0.000 sec)


-- テキストを分割 (空白の数がすべてのレコードで同じではない場合)
SELECT texts AS name,
        SUBSTRING_INDEX(texts, '　', 1) AS name1,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 2), '　', -1) AS name2,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 3), '　', -1) AS name3,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', -2), '　', 1) AS name4,
        SUBSTRING_INDEX(texts, '　', -1) AS name5
    FROM sample_data;

-- +-----------------------------------------------------+--------+----------+-----------------+-----------------+-------+
-- | name                                                | name1  | name2    | name3           | name4           | name5 |
-- +-----------------------------------------------------+--------+----------+-----------------+-----------------+-------+
-- | ほげ　ふが　ほげら太郎　42                          | ほげ   | ふが     | ほげら太郎      | ほげら太郎      | 42    |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                | ほげ   | ふが23   | ぴよ            | ほげら花子      | 1729  |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                | ほげ   | ふが23   | ぴよ            | ほげら花子      | 1984  |
-- +-----------------------------------------------------+--------+----------+-----------------+-----------------+-------+
-- 3 rows in set (0.000 sec)


-- テキストを分割 (空白の数がすべてのレコードで同じ場合)
SELECT texts AS name,
        SUBSTRING_INDEX(texts, '　', 1) AS name1,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 2), '　', -1) AS name2,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', 3), '　', -1) AS name3,
        SUBSTRING_INDEX(SUBSTRING_INDEX(texts, '　', -2), '　', 1) AS name4,
        SUBSTRING_INDEX(texts, '　', -1) AS name5
    FROM sample_data2;

-- +-------------------------------------------------------+--------+----------+--------------+-----------------+-------+
-- | name                                                  | name1  | name2    | name3        | name4           | name5 |
-- +-------------------------------------------------------+--------+----------+--------------+-----------------+-------+
-- | ほげ　ふが　ぴよぴよ　ほげら太郎　42                  | ほげ   | ふが     | ぴよぴよ     | ほげら太郎      | 42    |
-- | ほげ　ふが23　ぴよ　ほげら花子　1729                  | ほげ   | ふが23   | ぴよ         | ほげら花子      | 1729  |
-- | ほげ　ふが23　ぴよ　ほげら花子　1984                  | ほげ   | ふが23   | ぴよ         | ほげら花子      | 1984  |
-- +-------------------------------------------------------+--------+----------+--------------+-----------------+-------+
-- 3 rows in set (0.000 sec)

